app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", nil]]
---
  def show

    params[:id] ? @author = Author.find(params[:id]) : @author = Author.new