app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fake"], ["created_at", "2016-08-05 01:43:46.508343"], ["updated_at", "2016-08-05 01:43:46.508343"]]
---
  def show
    @author = Author.create(name: "Fake")